#ifndef SRC_DATA 
#define SRC_DATA

#include <nlohmann/json.hpp>

const std::string CardMapVersion = "1.0.0.9";
nlohmann::json cardInfo;

nlohmann::json eggInfo = {
    {"支柱", "赞美支柱！"},
    {"尼哥", "尼哥爬"},
    {"hc", "hc爬!"},
};

nlohmann::json nicknameInfo = {
    {"12008", "三寒鸦烧金龙"}, {"12012", "爆牌"},   {"12018", "独角兽"}, {"12002", "igniIgni"}, {"12033", "金天气"},
    {"12034", "金天气"},       {"13007", "爆牌"},   {"13010", "小白龙"}, {"13012", "绿龙"},     {"13014", "三基佬"},
    {"13013", "三基佬"},       {"13017", "三基佬"}, {"23007", "三美女"}, {"23008", "三美女"},   {"23004", "三美女"},
    {"33006", "爆牌"},         {"33007", "指哥"},   {"44023", "轻骑兵"}, {"53009", "大萝卜"},   {"52004", "洗脚妹"},
    {"70019", "三矮子"},       {"70020", "三矮子"}, {"70021", "三矮子"}};

#endif // SRC_DATA
